[
  {
    "name": "Git",
    "website": "git-scm.com",
    "description": "Git is a distributed version-control system for tracking changes in source code during software development. It is designed for coordinating work among programmers, but it can be used to track changes in any set of files. Its goals include speed, data integrity, and support for distributed, non-linear workflows"
  },
  {
    "name": "Docker",
    "website": "docker.com",
    "description": "Docker is a computer program that performs operating-system-level virtualization. It was first released in 2013 and is developed by Docker, Inc."
  },
  {
    "name": "Jenkins",
    "website": "jenkins.io",
    "description": "Jenkins is an open source automation server written in Java. Jenkins helps to automate the non-human part of the software development process, with continuous integration and facilitating technical aspects of continuous delivery"
  },
  {
    "name": "Ubuntu",
    "website": "ubuntu.com",
    "description": "Ubuntu is a free and open-source Linux distribution based on Debian"
  },
  {
    "name": "CentOS",
    "website": "centos.org",
    "description": "CentOS is a Linux distribution that provides a free, enterprise-class, community-supported computing platform functionally compatible with its upstream source, Red Hat Enterprise Linux"
  },
  {
    "name": "Debian",
    "website": "debian.org",
    "description": "Debian is a Unix-like computer operating system that is composed entirely of free software, and packaged by a group of individuals participating in the Debian Project"
  },
  {
    "name": "Gentoo",
    "website": "gentoo.org",
    "description": "Gentoo Linux is a Linux distribution built using the Portage package management system. Unlike a binary software distribution, the source code is compiled locally according to the user's preferences and is often optimized for the specific type of computer. Precompiled binaries are available for some larger packages or those with no available source code"
  },
  {
    "name": "Fedora",
    "website": "getfedora.org",
    "description": "Fedora is a Linux distribution developed by the community-supported Fedora Project and sponsored by Red Hat. Fedora contains software distributed under various free and open-source licenses and aims to be on the leading edge of such technologies. Fedora is the upstream source of the commercial Red Hat Enterprise Linux distribution"
  },
  {
    "name": "Nginx",
    "website": "nginx.org",
    "description": "Nginx is a web server which can also be used as a reverse proxy, load balancer, mail proxy and HTTP cache"
  },
  {
    "name": "CloudFlare",
    "website": "cloudflare.com",
    "description": "Cloudflare, Inc. is a U.S. company that provides content delivery network services, DDoS mitigation, Internet security and distributed domain name server services"
  },
  {
    "name": "Apache",
    "website": "httpd.apache.org",
    "description": "The Apache HTTP Server, colloquially called Apache, is free and open-source cross-platform web server software"
  },
  {
    "name": "RackCache",
    "website": "http://rtomayko.github.io/rack-cache/",
    "description": "Real HTTP Caching for Ruby Web Apps"
  },
  {
    "name": "Windows Server",
    "website": "windowsserver.com",
    "description": "Windows Server is a brand name for a group of server operating systems released by Microsoft"
  },
  {
    "name": "IIS",
    "website": "iis.net",
    "description": "Internet Information Services (IIS, formerly Internet Information Server) is an extensible web server created by Microsoft for use with the Windows NT family. IIS supports HTTP, HTTP/2, HTTPS, FTP, FTPS, SMTP and NNTP"
  },
  {
    "name": "Windows Server",
    "website": "windowsserver.com",
    "description": "Windows Server is a brand name for a group of server operating systems released by Microsoft"
  },
  {
    "name": "OpenResty",
    "website": "https://openresty.org/en/",
    "description": "Scalable Web Platform by Extending Nginx with Lua"
  },
  {
    "name": "Plesk",
    "website": "plesk.com",
    "description": "Plesk is a commercial web hosting platform with a control panel that allows a server administrator to set up new websites, reseller accounts, e-mail accounts and DNS entries through a web-based interface"
  },
  {
    "name": "Akamai",
    "website": "akamai.com",
    "description": "Akamai Technologies, Inc. is an American content delivery network (CDN) and cloud service provider headquartered in Cambridge, Massachusetts, in the United States"
  },
  {
    "name": "Incapsula",
    "website": "incapsula.com",
    "description": "Incapsula is a security CDN that makes any website safer, faster and more reliable"
  },
  {
    "name": "Netlify",
    "website": "netlify.com",
    "description": "Netlify is a San Francisco-based cloud computing company that offers hosting and serverless backend services for static websites"
  },
  {
    "name": "Caddy",
    "website": "caddyserver.com",
    "description": "Fast, cross-platform HTTP/2 web server with automatic HTTPS written in Go"
  },
  {
    "name": "Google App Engine",
    "website": "cloud.google.com/appengine",
    "description": "Google App Engine (often referred to as GAE or simply App Engine) is a web framework and cloud computing platform for developing and hosting web applications in Google-managed data centers. Applications are sandboxed and run across multiple servers. App Engine offers automatic scaling for web applications—as the number of requests increases for an application, App Engine automatically allocates more resources for the web application to handle the additional demand"
  },
  {
    "name": "Apache Tomcat",
    "website": "tomcat.apache.org",
    "description": "Apache Tomcat, often referred to as Tomcat Server, is an open-source Java Servlet Container developed by the Apache Software Foundation (ASF). Tomcat implements several Java EE specifications including Java Servlet, JavaServer Pages (JSP), Java EL, and WebSocket, and provides a \"pure Java\" HTTP web server environment in which Java code can run"
  },
  {
    "name": "Phusion Passenger",
    "website": "phusionpassenger.com",
    "description": "Phusion Passenger is a free web server and application server with support for Ruby, Python and Node.js. It is designed to integrate into the Apache HTTP Server or the nginx web server, but also has a mode for running standalone without an external web server"
  },
  {
    "name": "Firebase",
    "website": "firebase.google.com",
    "description": "Firebase is a mobile and web application development platform. It gives you functionality like analytics, databases, messaging and crash reporting so you can move quickly and focus on your users"
  },
  {
    "name": "GitHub",
    "website": "github.com",
    "description": "GitHub is a web-based hosting service for version control using Git. It is mostly used for computer code. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features"
  },
  {
    "name": "GitLab",
    "website": "gitlab.com",
    "description": "GitLab is a web-based DevOps lifecycle tool that provides a Git-repository manager providing wiki, issue-tracking and CI/CD pipeline features, using an open-source license, developed by GitLab Inc."
  },
  {
    "name": "Bitbucket",
    "website": "bitbucket.org",
    "description": "Bitbucket is a web-based version control repository hosting service owned by Atlassian, for source code and development projects that use either Mercurial (since launch) or Git (since October 2011) revision control systems"
  },
  {
    "name": "AWS",
    "website": "aws.amazon.com",
    "description": "Amazon Web Services (AWS) is a subsidiary of Amazon that provides on-demand cloud computing platforms to individuals, companies and governments, on a paid subscription basis. The technology allows subscribers to have at their disposal a virtual cluster of computers, available all the time, through the Internet"
  },
  {
    "name": "Heroku",
    "website": "heroku.com",
    "description": "Heroku is a cloud platform as a service (PaaS) supporting several programming languages. Heroku, one of the first cloud platforms, has been in development since June 2007, when it supported only the Ruby programming language, but now supports Java, Node.js, Scala, Clojure, Python, PHP, and Go. For this reason, Heroku is said to be a polyglot platform as it has features for a developer to build, run and scale applications in a similar manner across most languages. Heroku was acquired by Salesforce.com in 2010 for $212 million"
  },
  {
    "name": "DigitalOcean",
    "website": "www.digitalocean.com",
    "description": "DigitalOcean, Inc. is an American cloud infrastructure provider headquartered in New York City with data centers worldwide. DigitalOcean provides developers cloud services that help to deploy and scale applications that run simultaneously on multiple computers. As of January 2018, DigitalOcean was the third-largest hosting company in the world in terms of web-facing computers"
  }
]
